//
//  main.swift
//  AutoCataloge
//
//  Created by Dmitry on 30/03/2019.
//  Copyright © 2019 Dmitry. All rights reserved.
//

import Foundation

var commands = Commands ()
commands.consoleCommands()


/*
 Консоль должна:
 1. Выводить список команд и как их начать (hotkey)
 2. Команда вывести все автомобили
  а. выводит для каждого автомобиля все поля по порядку
 3. Команда добавить автомобиль
  а. Вводить все поля по порядку
 4. Команда удалить автомобиль по индексу из списка
 5. Команда обновить автомобиль по индексу из списка
    а. Вводить все поля по порядку с возможностью пропуска
 6. Выход
 */
